using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Kursova_Vitaliy
{
    public class Data 
    {
        static public bool[][] diseases = new bool[8][];
        static public string[][] info = new string[8][]; 
        static public bool[] selected;
        static public int[] rotation = new int[8]; 

        public static void Properties()
        {
                                   //Температура    Лімфовузли      Біль       Ломота      Нежить     Загальна      Головний      Біль    Почервоніння   Кашель
            //                                                     у горлі      у тілі                слабкість      біль        у вусі      горла
            //Фарингіт 
            diseases[0] = new bool[10] { true,      true,           true,       true,       false,      true,        false,       false,      true,       true };
            //Ларингіт
            diseases[1] = new bool[10] { true,      false,          true,       false,      false,      true,        false,       false,      true,       true };
            //Ангіна
            diseases[2] = new bool[10] { true,      true,           true,       true,       false,      true,        true,        false,      true,       false };
            //Гайморит
            diseases[3] = new bool[10] { true,      false,          false,      false,       true,      true,        true,        false,      false,      false };
            //Тонзиліт
            diseases[4] = new bool[10] { true,      true,           true,       true,       false,      true,        false,       false,      true,       false };
            //Отит
            diseases[5] = new bool[10] { true,      true,           false,      false,      false,      true,        true,        true,       false,      false };
            //Риніт
            diseases[6] = new bool[10] { false,     false,          false,      false,      true,       true,        false,       false,      true,       false };
            //Ринофарингіт
            diseases[7] = new bool[10] { false,     false,          true,        true,      true,       true,        false,       false,      true,        true };


            #region info[][]
            //Фарінгіт
            info[0] = new string[5]
{"Фарингіт","Фарингіт – запалення слизової оболонки глотки та мигдаликів,вірусної або бактеріальної природи. Лікування фарингіту на початкових стадіях \n"+
"гарантує повне зникнення проблеми, але при запущеному стані хвороба може стати хронічною та спровокувати розвиток проблем з іншими органами.","\nПричини\n"+
 "Природнй процес для людини – носове дихання. Носові ходи влаштовані так, щоб повітря,яке вдихається, надходило з невеликою затримкою. За ці паузи воно\n"+ 
 "зігрівається,фільтрується і у такому вигляді подається до організму.Коли ніс закладений, а дихання відбувається через рот, зростає ризик захворювання \n"+
"фарингітом — адже повітря не проходить через фільтри і надходить через рот з бактеріями, вірусами, пилом та ін.Друга часта причина захворювання фарингітом \n"+
"- нежить на тлі ГРВІ.У цьому випадку осередок запалення перебуває у горлі, розвиваючись поступово. Часта обробка носових ходів судинозвужувальними \n"+
"краплями негативно відбивається на стані глотки,що також спричиняє розвиток хвороби.","\nСтадії та симптоми\n"+
"Виділяють чотири стадії хвороби, для кожної з яких притаманні свої  ознаки та симптоми:\n"+
"Катаральний - супроводжується покашлюванням та першінням у горлі.\n"+
"Гранулезний - з'являється відчуття лоскоту у горлі. Невеликі горбики на слизовій оболонці горла збільшуються в розмірах.\n"+
"Гнійний - горбки запалені, спостерігається набряклість, гнійний наліт та виразки.\n"+
"Атрофічний – призводить до атрофування тканин горла, ковтальні функції майже неможливі.\n"+
" Фарингіт може бути гострим та хронічним. Для першого типу характерні такі симптоми:\n"+
"Першіння та сухість горла;\n"+
"Осілий голос;\n"+
"Підвищення температури;\n"+
"збільшення лімфовузлів.\n",
"\n Лікування\n"+
"Лікуванням фарингіту займається профільний спеціаліст отоларинголог (ЛОР).Для встановлення діагнозу використовується аналізи крові, мазок та інші.\n"+
 "Вибір терапії залежить від віку пацієнта. Під час лікування дітей методи значно відрізняються.До обов'язкових рекомендацій належить тепле питво, \n"+
 "провітрювання і вологе прибирання в приміщенні. Інгаляції та спреї – лише з дозволу лікаря та під наглядом дорослих.Такий самий обережний підхід\n"+
 "до процедур потрібний і для вагітних.До загальних рекомендацій при лікуванні фарингітів різного походження відноситься: тепле питво, дієта, відмова\n"+
 "від шкідливих звичок.Лікування може включати таблетки та льодяники для розсмоктування, аерозольні та масляні засоби.Добре при лікуванні фарингітів \n"+
 "зарекомендували себе та народні засоби. Це можуть бути трав'яні полоскання, ванни для ніг, содові інгаляції.Щоб лікування народними методами не \n"+
 "спричинило ускладнень,пам'ятайте: призначення повинен давати лікар."};


            //Ларингіт
            info[1] = new string[5] {"Ларингіт", "Ларингіт - запальний процес, який охоплює всю область гортані. \n Лікування\nЗбудниками хвороби можуть стати різні бактері та віруси, а зростанню їх чисельності сприяє низка негативних факторів. Розрізняється кілька форм ларингіту, \n"+
 "кожної з яких характерні особливі симптоми. Як лікувати ларингіт, у кожному випадку вирішує ЛИШЕ лікар","\nПричини\nСпричинити ларингіт можуть різні причини.Виділяють окремі групи збудників, що часто зустрічаються:\n"+
"Переохолодження всього організму або його частин.\n"+
"Вдихання морозного або гарячого повітря.\n"+
"Хірургічне втручання.\n"+
"Хімічний вплив на горло.\n"+
"Сильне напруження голосових зв'язок.\n"+
"Сприяє появі ларингітів зловживання алкоголем та тютюном. У деяких випадках причиною ларингітів є алергічна реакція різні подразники. Негативний вплив мають \n"+
"стоматологічні проблеми, а також ослаблений імунітет.Якими б не були причини появи хвороби, лікування ларингіту необхідно проводити своєчасно та під\n"+
"наглядом профільних фахівців.",
"\nСимптоми\nНа початок запальних процесів при ларингіті вказують такі симптоми:\n"+
"Біль при ковтанні та мові;\n"+
"Дряпаючі відчуття у горлі;\n"+
"Зниження тембру голосу;\n"+
"Незначне підвищення температури;\n"+
"Збільшення лімфатичних вузлів\n", "\nПрофілактика\nВід багатьох форм ларингіту вбереже просте дотримання правил гігієни. Важливо уникати переохолодження, застосовувати \n"+
"процедури, що гартують, вчасно відвідувати стоматолога. Стежити за режимом дня, берегти голосові зв'язки, відмовитися від шкідливих звичок. Вчасно проводити лікування \n"+
"застудних та вірусних захворювань, не приймати медикаменти безконтрольно,вживати вітаміни та мінерали.За шкідливих умов праці (хімічна промисловість та ін.) \n"+
"носити марлеві пов'язки чи респіратори."};

            //Ангіна
            info[2] = new string[5] { "Ангіна ","Ангіна - це інфекційне захворювання, яке супроводжується гострим запаленням в області піднебінних мигдаликів.\n"+
"Основними факторами, що провокують, для нього є віруси, грибки або бактерії. При ураженні лімфоїдного апарату глотки здебільшого спостерігається гострий \n"+
"характер прояву симптомів захворювання.","\nСимптоми\nПри діагностуванні захворювання виявляють такі збудники:\n"+
"Cтафілококи;\n"+
"Аденовірус;\n"+
"Грибок роду Candida;\n"+
"Вірус Коксакі групи А\n"+
 "Попадання інфекції та осідання її на мигдаликах не завжди призводить до розвитку ангіни. Дія мікробів активізується під впливом факторів, що провокують:\n"+
 "переохолодження, різкі зміни температури навколишнього середовища, знижений імунітет.Стимулюють розвиток захворювання та деякі подразники, які регулярно \n"+
 "потрапляють у горло: пил, дим, пилок, шерсть. ","\nТипи та симптоми\nЗалежно від форми захворювання, типу збудника та ступеня ураження ангіною відрізнятимуться загальні клінічні симптоми:\n"+
"Катаральний. інфекція поширюється на слизову оболонку мигдаликів. Симптоми: болі у горлі, почервоніння та припухлість мигдаликів, підвищення температури.\n"+
"Фолікулярна. Первинною ознакою є біль у горлі, який починається гостро і супроводжується різким підвищенням температури. Людина відчуває слабкість,\n"+
"ломоту в м'язах та суглобах, головний біль. На мигдаликах з'являються фолікули, що нагноїлися, розміром 1-3 мм, які розкриваються на другий-четвертий день.\n"+
"Лакунарна ангіна. глибока ступінь ураження мигдаликів. Мигдалики стають яскраво-червоного кольору, ними явно помітний жовто-білий наліт. Болючість у горлі \n"+
"супроводжується загальною інтоксикацією організму.\n"+
"Некротична ангіна зустрічається досить рідко та характеризується наявністю некротизованих ділянок.Поява симптомів починається після закінчення інкубаційного \n"+
"періоду. На тлі підвищеної температури можуть виникати фебрильні судоми - сильна напруга в м'язах, що змінюється здриганнями і посмикуваннями.","\nЛікування\nМетод "+
"лікування полягає не тільки в усуненні збудника захворювання. Пацієнту призначаються:Регулярні полоскання горла сольовим розчином чи спеціальними \n"+
"антибактеріальними засобами.Препарати місцевої дії з антибактеріальною та знеболювальною дією: таблетки, спреї, льодяники.Лікування жарознижувальними \n"+
"препаратами за необхідності.Антибіотики, які призначаються лише після оцінки результатів лабораторних досліджень крові та мазків."};



            //Гайморит
            info[3] = new string[5] { "Гайморит", "Гайморит - це запальний процес у гайморових пазухах, що відноситься до одного з видів синуситу.", 
"\nПричини\nПотрапляння до гайморових пазух патогенних мікроорганізмів вірусного або бактеріального походження — найчастіша причина виникнення захворювання.\n"+
"Найбільша кількість випадків захворювання на гайморит фіксується в осінньо-зимовий період, коли організм людини ослаблений і не може протистояти\n"+
"провокуючим захворюванням бактеріям", "\nСимтоми\nДля гаймориту характерні явні ознаки захворювання, що посилюються у вечірній час доби та ослаблені вранці. \n"+
"До симптомів, що викликає гайморит, відносять:\n"+
"Виділення слизу з носа.\n"+
"Тривала закладеність носа.\n"+
"Збільшення температури при гострому гаймориті.\n"+
"Загальна слабкість, запаморочення, підвищена стомлюваність.\n"+
"Виникнення в області перенісся болю та сильного тиску, які можуть збільшуватися при нахилі голови вперед. Втрата апетиту.","\nЛіуквання\nЗалежно від рівня розвитку \n"+
"патології, методи лікування гаймориту різняться. За відсутності великого скупчення гнійних мас лікування буде спрямованим на придушення симптомів\n"+
"гаймориту та усунення інфекції, що спричинила гайморит. Лікувати захворювання найчастіше рекомендується стандартними методами:\n"+
"Використання препаратів для полегшення носового дихання.\n"+
"Антисептичні засоби місцевого застосування для надання основної дії на розмноження хвороботворних мікроорганізмів.\n"+
"Протизапальні засоби та медикаменти, що сприяють виведенню слизу з верхніх дихальних шляхів." };
            //Тонзиліт
            info[4] = new string[5] { "Тонзиліт", "Тонзиліт - це запальний процес, який вражає одну або кілька мигдаликів лімфатичного глоткового кільця. У 80% випадків тонзиліти \n"+
"спровоковані бета-гемолітичним стрептококом, в інших причиною є різні бактерії, стафілококи, грибкові мікроорганізми. При несвоєчасно розпочатому лікуванні\n"+
"вогнище запалення поширюється далі і вражає м'які тканини, що оточують, тонзиліт переходить в гостру фазу.","\nСимтоми\nЗалежно від форми захворювання, \n"+
"загальні симптоми при тонзиліті відрізнятимуться. Людина заражається повітряно-краплинним шляхом від інфікованого. Після закінчення інкубаційного періоду \n"+
"протягом 1-2 днів відчуває перші гострі симптоми тонзиліту:\n"+
"Біль у горлі, що посилюється при ковтанні.\n"+
"Загальна слабкість, ломота у м'язах та суглобах.\n"+
"Підвищення температури.\n"+
"Збільшення лімфатичних вузлів у сфері горла.\n"+
"Озноб\n"+
"Головні болі", " \nПрофілактика\nНайбільше випадків виникнення захворювання спостерігається в осінньо-зимові періоди. Проживання у несприятливій екологічній обстановці та \n"+
"часте перебування у місцях великого скупчення людей також призводить до підвищення ризику виникнення захворювання. Для зменшення ймовірності \n"+
"зараження рекомендується відповідально ставитись до особистого здоров'я. У періоди спалахів захворювань на тонзиліт бажано приймати вітамінні\n"+
"комплекси, спрямовані на зміцнення захисних сил організму. Важливо уникати переохолоджень, які можуть спричинити біль у горлі та тонзиліт зокрема.",""};

            //Отит
            info[5] = new string[5] {"Отит", 
"Виникнення запалення у вусі у медичній практиці відоме, як отит. Характерною ознакою отиту, що говорить про те, що хвороба настала, є нестерпний біль, \n"+
"що локалізується у вусі. Захворіти на отит можуть не тільки дорослі, а й діти, особливо представники молодшого дошкільного віку.",
"\nПричини\nОсновними причинами виникнення хвороби вважаються:\n"+
"зараження хвороботворними мікроорганізмами з інших ЛОР-органів Отит, зазвичай, є супутнім ускладненням при вірусної хвороби пацієнта;\n"+
"всілякі зараження носоглотки, носа та його пазух. Аденоїди, риніти, неправильна форма носової перегородки все це стає причинами отитів;\n"+
"травмування вушної раковини;\n"+
"слабка імунна система; переохолодження.\n"+
"Захворіти на отит також «допомагає»:\n"+
"хірургічне втручання у зону носоглотки або носової порожнини;\n"+
"дитячий, дитячий вік.",
"\nЛікування\nЛікування має здійснюватися обов'язково під наглядом грамотного лікаря. Лікують отит за допомогою:\n"+
"прийому анальгетиків - призначаються для зняття гострого болю;\n"+
"відновлення оптимальної температури тіла - у такому разі не обійтися без жарознижуючих;\n"+
"у ускладнених випадках необхідний прийом антибіотиків;\n"+
"крапель у вуха - призначення проводиться лікарем, у разі самостійного підбору є ризик виникнення незворотних наслідків для здоров'я і життя пацієнта;\n"+
"призначення антигістамінних засобів – для зменшення симптому набряку;\n"+
"відвідування фізіотерапевтичного кабінету;\n"+
"якщо необхідно, призначається хірургічна операція."+
"Тільки дотримання всіх призначених лором рекомендацій, а також виключення всіх ознак захворювання \n"+
"дозволить швидко та без наслідків вилікуватися від отитів.",
"\nПрофілактика\nДля запобігання ризику отитів під час ЛОР-захворювань необхідно дотримуватися наступного:\n"+
"застосовувати для носа спеціальні судинозвужувальні краплі, що знімають набряк слизової оболонки носоглотки;\n"+
"використовувати більше води, морсів, компотів підтримки оптимального водного балансу;\n"+
"приймати препарати, що зменшують температуру тіла;\n"+
"стежити, щоб температура повітря у приміщенні не перевищувала 18–20 ºС;\n"+
"проводити вологе прибирання (щодня) та провітрювання кімнати (кожну годину);\n"+
"ретельно висмаркувати слиз із носоглотки, щоб не стався застій та блокування слухових труб.",};

            //Риніт
            info[6] = new string[5]{"Риніт",
"Риніт це запалення розташованих у носі слизових оболонок. Хвороба спричинена можливо наслідком ускладнення гострого риніту чи під впливом шкідливих зовнішніх чинників.","\nПричини\nДо розвитку хронічної форми зазвичай наводять:\n"+
"часті випадки виникнення гострого риніту та інших респіраторних захворювань\n"+
"перегрівання або переохолодження\n"+
"тривалі дії різних речовин на слизові оболонки (пилу, газу, диму, різних алергенів)\n"+
"знаходження у безпосередній близькості від носа джерел інфекції (наприклад, каріозних зубів або аденоїдів)\n"+
"хвороби внутрішніх органів (серця, нирок, шлунка), що сприяють зниженню імунітету\n"+
"неправильна будова пазух або носової раковини, викривлення перегородки носа\n"+
"ушкодження слизових оболонок – механічне або що виникло внаслідок тяжкого захворювання (дифтерії, скарлатини)\n"+
"порушення інструкції з використання судинозвужувальних крапель\n"+
"спадкова схильність.","\nСимптоми\nНайбільш часта причина нежиті — простудні та вірусні захворювання. У цьому випадку спостерігається гострий риніт, \n"+
"симптоми якого відрізняються в залежності від стадії хвороби:\n"+
"1 стадія. Подразнення слизових оболонок, що супроводжується частим чханням, свербінням в носі, почуттям печіння, сльозотеча. На цьому етапі слизова починає \n"+
"сильно набрякати,порушується носове дихання, спостерігається загальне нездужання.\n"+
"2 стадія. Рясні рідкі виділення, як правило, прозорі. Є закладеність носа.\n"+
"3 стадія. Виділення стають слизисто-гнійними, густими, жовтуватого або зеленуватого кольору. Може погіршуватися нюх, з'являються головні болі.\n"+
"При ослабленому імунітеті інфекція починає поширюватися і викликає запалення середнього вуха (отит), ларингіт, захворювання очей.",
"\nЛікування\nПри підтвердженій аналізами бактеріальній інфекції призначають антибактеріальні спреї і лікування антибіотиками. Інгаляція при нежиті може виконуватисяn\n"+
"за допомогою небулайзера з використанням препарату, призначеного лікарем. При алергії хороший результат забезпечують кортикостероїдні препарати, які призначаються курсами. \n"+
"Перед тим, як лікувати риніт алергічної природи і сінну лихоманку необхідна консультація фахівця."};

            //Ринофарингіт
            info[7] = new string[5] { "Ринофарингіт",
"Респіраторні захворювання верхніх дихальних шляхів є частою патологією, особливо в осінньо-зимовий період. Ринофарингіт (назофарингіт, епіфарингіт,\n"+ 
"риноназофарингіт)- це інфекційне захворювання носоглотки, що супроводжується характерними для застуди симптомами. Найчастіше назофарингіт розвивається\n"+
"у дітей дошкільного та молодшого шкільного віку.", 
"\nПричини ринофарингіту\nОсновні причини ринофарингіту – віруси. Захворювання можуть спричинити близько 200 вірусів, найчастіше це риновіруси, аденовіруси, \n"+
"віруси парагрипу, грипу, ECHO-віруси, РС-віруси (респіраторно-синцитіальні), бокавірус, коронавіруси, метапневмовіруси. Розвиток назофарингіту викликають також \n"+
"бактерії та найпростіші (стрептококи, стафілококи, мікоплазми, хламідії).",
"\nСимптоми\nЗапалення носоглотки супроводжується почервонінням, набуханням та набряком слизової оболонки. У дорослих захворювання протікає без підвищення \n"+
"температури.Cимптоми ринофарингіту:\n"+
"закладеність носа, слизові та/або гнійні виділення з носа;\n"+
"неприємні відчуття в носоглотці (поколювання, сухість, печіння);\n"+
"утруднене носове дихання;\n"+
"свербіння та першіння в горлі;\n"+
"осиплість голосу;\n"+
"хворобливі відчуття у горлі;\n"+
"непродуктивний кашель;\n"+
"головний біль у потилиці;\n"+
"збільшення лімфатичних вузлів.", 
"\nЛікування\nЛікування ринофарингіту проводять вдома під контролем ЛОР-лікаря чи дитячого отоларинголога. Особи, що доглядають хворого, повинні дотримуватися гігієнічних заходів.\n"+
"Лікування ринофарингіту проводять вдома під контролем ЛОР-лікаря чи дитячого отоларинголога. Особи, що доглядають хворого, повинні дотримуватися гігієнічних заходів, \n"+
"щоб не захворіти самим. Амбулаторне лікування показано за наявності хронічних патологій, розвитку ускладнень та тяжкому перебігу захворювання щоб не захворіти самим. \n"+
"Амбулаторне лікування показано за наявності хронічних патологій, розвитку ускладнень та тяжкому перебігу захворювання."};

            #endregion 
        }
         
        
        public static int[] Coincidence(bool[][] diseases, bool[] selected) //Визначення захворювання в балах (від 1 до 10 балів)
        {
            int[] k = new int[diseases.Length];
            for (int i = 0; i < diseases.Length; i++)
            {
                for (int j = 0; j < diseases.Length; j++)
                {
                    if (diseases[i][j] == selected[j])
                    {
                        k[i]++;
                    }
                }
            }
            return k;
        }
    }
}
